app/Controllers/Alternatif.php

    public function index()
    {
        $db = \Config\Database::connect();
        $query = $db->table('alternatif')
                    ->select('alternatif.*, users.nama as nama_pembuat')
                    ->join('users', 'users.id_user = alternatif.created_by', 'left')
                    ->orderBy('alternatif.id_alternatif', 'DESC')
                    ->get();

        $data = [
            'title'      => 'Katalog Tempat Makan (Alternatif) | SPK SMART',
            'alternatif' => $query->getResultArray()
        ];
---
SELECT *
FROM `alternatif`