app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function processLogin()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('email', $email)->first();