app/Controllers/Feedback.php

SELECT `feedback_rekomendasi`.*, `users`.`nama` as `nama_user`
FROM `feedback_rekomendasi`
JOIN `users` ON `users`.`id_user` = `feedback_rekomendasi`.`id_user`
ORDER BY `feedback_rekomendasi`.`created_at` DESC
---
    public function admin()
    {
        if (session()->get('role') != 'admin') return redirect()->to(base_url('home'));

        $db = \Config\Database::connect();

        $builder = $db->table('feedback_rekomendasi');
        $builder->select('feedback_rekomendasi.*, users.nama as nama_user');
        $builder->join('users', 'users.id_user = feedback_rekomendasi.id_user');
        $builder->orderBy('feedback_rekomendasi.created_at', 'DESC');
        $feedbacks = $builder->get()->getResultArray();