app/Controllers/Penilaian.php

    public function store()
    {
        $nama_responden = $this->request->getPost('nama_responden');
        $id_alternatif = $this->request->getPost('id_alternatif');
        $nilai = $this->request->getPost('nilai'); // Ini berupa array [id_kriteria => nilai]

        // Validasi dasar
        if(empty($nama_responden) || empty($id_alternatif)) {
            session()->setFlashdata('error', 'Nama Responden dan Alternatif harus diisi.');
            return redirect()->to(base_url('penilaian/create'))->withInput();
        }

        // Cek duplikasi
        $cek = $this->penilaianModel->where('nama_responden', $nama_responden)
                                    ->where('id_alternatif', $id_alternatif)
                                    ->first();
        if ($cek) {
            session()->setFlashdata('error', "Responden {$nama_responden} sudah memberikan penilaian untuk tempat makan tersebut.");
            return redirect()->to(base_url('penilaian/create'))->withInput();
        }

        // Insert ke tabel penilaian
        $this->penilaianModel->insert([
            'nama_responden' => $nama_responden,
            'id_alternatif'  => $id_alternatif
        ]);
---
SELECT *
FROM `penilaian`
WHERE `nama_responden` = 'Anil'
AND `id_alternatif` = '1'
 LIMIT 1
INSERT INTO `penilaian` (`nama_responden`, `id_alternatif`) VALUES ('Anil', '1')

        }

        if (!empty($detailData)) {
            $this->detailPenilaianModel->insertBatch($detailData);
---
INSERT INTO `detail_penilaian` (`id_kriteria`, `id_penilaian`, `nilai`)
VALUES (1,1,10), (2,1,60), (3,1,60), (4,1,20), (5,1,80), (6,1,80)

    public function update($id)
    {
        $nama_responden = $this->request->getPost('nama_responden');
        $id_alternatif = $this->request->getPost('id_alternatif');
        $nilai = $this->request->getPost('nilai');

        // Validasi dasar
        if(empty($nama_responden) || empty($id_alternatif)) {
            session()->setFlashdata('error', 'Nama Responden dan Alternatif harus diisi.');
            return redirect()->to(base_url('penilaian/edit/'.$id))->withInput();
        }

        // Cek duplikasi jika mengubah responden atau alternatif
        $cek = $this->penilaianModel->where('nama_responden', $nama_responden)
                                    ->where('id_alternatif', $id_alternatif)
                                    ->where('id_penilaian !=', $id)
                                    ->first();
        if ($cek) {
            session()->setFlashdata('error', 'Responden ini sudah memberikan penilaian untuk alternatif tersebut.');
            return redirect()->to(base_url('penilaian/edit/' . $id))->withInput();
        }

        // Update penilaian utama
        $this->penilaianModel->update($id, [
            'nama_responden' => $nama_responden,
            'id_alternatif'  => $id_alternatif
        ]);

        // Karena dinamis, cara termudah update adalah hapus semua detail lama lalu insert baru
        $this->detailPenilaianModel->where('id_penilaian', $id)->delete();
---
SELECT *
FROM `penilaian`
WHERE `penilaian`.`id_penilaian` = '3'