app/Controllers/Penilaian.php

    public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('penilaian')
                      ->select('penilaian.*, alternatif.nama_alternatif, users.nama as nama_user')
                      ->join('alternatif', 'alternatif.id_alternatif = penilaian.id_alternatif')
                      ->join('users', 'users.id_user = penilaian.id_user')
                      ->orderBy('penilaian.id_penilaian', 'DESC');

        if (session()->get('role') != 'admin') {
            $builder->where('penilaian.id_user', session()->get('id_user'));
        }

        $penilaian = $builder->get()->getResultArray();
        $kriteria = $this->kriteriaModel->findAll();

        $nilaiMatrix = [];
        $details = $this->detailPenilaianModel->findAll();
        foreach($details as $d) {
            $nilaiMatrix[$d['id_penilaian']][$d['id_kriteria']] = $d['nilai'];
        }

        $data = [
            'title'      => session()->get('role') == 'admin' ? 'Data Penilaian Global | SPK SMART' : 'Data Penilaian Saya | SPK SMART',
            'penilaian'  => $penilaian,
            'kriteria'   => $kriteria,
            'nilaiMatrix'=> $nilaiMatrix
        ];
---
SELECT `penilaian`.*, `alternatif`.`nama_alternatif`
FROM `penilaian`
JOIN `alternatif` ON `alternatif`.`id_alternatif` = `penilaian`.`id_alternatif`
ORDER BY `penilaian`.`id_penilaian` DESC
SELECT `penilaian`.*, `alternatif`.`nama_alternatif`, `users`.`nama` as `nama_user`
FROM `penilaian`
JOIN `alternatif` ON `alternatif`.`id_alternatif` = `penilaian`.`id_alternatif`
JOIN `users` ON `users`.`id_user` = `penilaian`.`id_user`
WHERE `penilaian`.`id_user` = '2'
ORDER BY `penilaian`.`id_penilaian` DESC
SELECT *
FROM `kriteria`
SELECT *
FROM `detail_penilaian`
SELECT *
FROM `alternatif`

    public function store()
    {
        if (session()->get('role') == 'admin') {
            return redirect()->to(base_url('penilaian'))->with('error', 'Akses ditolak.');
        }

        $id_alternatif = $this->request->getPost('id_alternatif');
        $nilai = $this->request->getPost('nilai'); // array [id_kriteria => nilai]
        $id_user = session()->get('id_user');

        if(empty($id_alternatif)) {
            session()->setFlashdata('error', 'Alternatif harus dipilih.');
            return redirect()->to(base_url('penilaian/create'))->withInput();
        }

        // Cek duplikasi penilaian oleh user untuk alternatif ini
        $cek = $this->penilaianModel->where('id_user', $id_user)
                                    ->where('id_alternatif', $id_alternatif)
                                    ->first();
        if ($cek) {
            session()->setFlashdata('error', "Anda sudah memberikan penilaian untuk tempat makan ini.");
            return redirect()->to(base_url('penilaian/create'))->withInput();
        }

        $this->penilaianModel->insert([
            'id_user'        => $id_user,
            'id_alternatif'  => $id_alternatif
        ]);
---
SELECT *
FROM `penilaian`
WHERE `id_user` = '2'
AND `id_alternatif` = '3'
 LIMIT 1
INSERT INTO `penilaian` (`id_user`, `id_alternatif`) VALUES ('2', '3')

        }

        if (!empty($detailData)) {
            $this->detailPenilaianModel->insertBatch($detailData);
---
INSERT INTO `detail_penilaian` (`id_kriteria`, `id_penilaian`, `nilai`)
VALUES (1,3,100), (2,3,60), (3,3,80), (4,3,80), (5,3,60), (6,3,100)

    public function edit($id)
    {
        $penilaian = $this->penilaianModel->find($id);
        if(!$penilaian) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        if (session()->get('role') != 'admin' && $penilaian['id_user'] != session()->get('id_user')) {
            session()->setFlashdata('error', 'Anda tidak berhak mengedit penilaian ini.');
            return redirect()->to(base_url('penilaian'));
        }

        $details = $this->detailPenilaianModel->where('id_penilaian', $id)->findAll();
        $nilaiSelesai = [];
        foreach($details as $d) {
            $nilaiSelesai[$d['id_kriteria']] = $this->mapSmartToSkala($d['nilai']);
        }

        $data = [
            'title'      => 'Edit Penilaian | SPK SMART',
            'validation' => \Config\Services::validation(),
            'penilaian'  => $penilaian,
            'alternatif' => $this->alternatifModel->findAll(),
            'kriteria'   => $this->kriteriaModel->findAll(),
---
SELECT *
FROM `penilaian`
WHERE `penilaian`.`id_penilaian` = '3'
SELECT *
FROM `detail_penilaian`
WHERE `id_penilaian` = '3'
SELECT *
FROM `alternatif`
SELECT *
FROM `kriteria`

    public function update($id)
    {
        $penilaian = $this->penilaianModel->find($id);
        if (session()->get('role') != 'admin' && $penilaian['id_user'] != session()->get('id_user')) {
            return redirect()->to(base_url('penilaian'));
        }

        $id_alternatif = $this->request->getPost('id_alternatif');
        $nilai = $this->request->getPost('nilai');

        if(empty($id_alternatif)) {
            session()->setFlashdata('error', 'Alternatif harus diisi.');
            return redirect()->to(base_url('penilaian/edit/'.$id))->withInput();
        }

        // Cek duplikasi jika user mengubah alternatif ke alternatif yang sudah dinilainya
        $cek = $this->penilaianModel->where('id_user', $penilaian['id_user'])
                                    ->where('id_alternatif', $id_alternatif)
                                    ->where('id_penilaian !=', $id)
                                    ->first();
        if ($cek) {
            session()->setFlashdata('error', 'Anda sudah memberikan penilaian untuk alternatif tersebut.');
            return redirect()->to(base_url('penilaian/edit/' . $id))->withInput();
        }

        $this->penilaianModel->update($id, [
            'id_alternatif'  => $id_alternatif
        ]);

        $this->detailPenilaianModel->where('id_penilaian', $id)->delete();
---
SELECT *
FROM `penilaian`
WHERE `id_user` = '2'
AND `id_alternatif` = '3'
AND `id_penilaian` != '3'
 LIMIT 1
UPDATE `penilaian` SET `id_alternatif` = '3'
WHERE `penilaian`.`id_penilaian` IN ('3')
DELETE FROM `detail_penilaian`
WHERE `id_penilaian` = '3'

        }

        if (!empty($detailData)) {
            $this->detailPenilaianModel->insertBatch($detailData);
---
INSERT INTO `detail_penilaian` (`id_kriteria`, `id_penilaian`, `nilai`)
VALUES (1,'3',100), (2,'3',60), (3,'3',80), (4,'3',80), (5,'3',60), (6,'3',100)