app/Controllers/Smart.php

    public function kriteria()
    {
        $data = [
            'title'    => 'Kriteria & Bobot | SPK SMART',
            'kriteria' => $this->kriteriaModel->findAll()
---
SELECT *
FROM `kriteria`

    public function rata_rata()
    {
        $db = \Config\Database::connect();

        // Dapatkan rata-rata nilai per alternatif dan per kriteria
        // menggunakan query AVG pada tabel detail_penilaian yang di-join dengan penilaian
        $rataQuery = $db->table('detail_penilaian')
                        ->select('penilaian.id_alternatif, detail_penilaian.id_kriteria, AVG(detail_penilaian.nilai) as rata_nilai')
                        ->join('penilaian', 'penilaian.id_penilaian = detail_penilaian.id_penilaian')
                        ->groupBy('penilaian.id_alternatif, detail_penilaian.id_kriteria')
                        ->get()->getResultArray();

        $matrix = [];
        foreach ($rataQuery as $r) {
            $matrix[$r['id_alternatif']][$r['id_kriteria']] = (float) $r['rata_nilai'];
        }

        $alternatif = $this->alternatifModel->findAll();
---
SELECT `penilaian`.`id_alternatif`, `detail_penilaian`.`id_kriteria`, AVG(detail_penilaian.nilai) as rata_nilai
FROM `detail_penilaian`
JOIN `penilaian` ON `penilaian`.`id_penilaian` = `detail_penilaian`.`id_penilaian`
GROUP BY `penilaian`.`id_alternatif`, `detail_penilaian`.`id_kriteria`
SELECT *
FROM `alternatif`

    public function utility()
    {
        $db = \Config\Database::connect();
        $rataQuery = $db->table('detail_penilaian')
                        ->select('penilaian.id_alternatif, detail_penilaian.id_kriteria, AVG(detail_penilaian.nilai) as rata_nilai')
                        ->join('penilaian', 'penilaian.id_penilaian = detail_penilaian.id_penilaian')
                        ->groupBy('penilaian.id_alternatif, detail_penilaian.id_kriteria')
                        ->get()->getResultArray();

        $matrix = [];
        foreach ($rataQuery as $r) {
            $matrix[$r['id_alternatif']][$r['id_kriteria']] = (float) $r['rata_nilai'];
        }

        $alternatif = $this->alternatifModel->findAll();
        $kriteria = $this->kriteriaModel->findAll();
---
SELECT `penilaian`.`id_alternatif`, `detail_penilaian`.`id_kriteria`, AVG(detail_penilaian.nilai) as rata_nilai
FROM `detail_penilaian`
JOIN `penilaian` ON `penilaian`.`id_penilaian` = `detail_penilaian`.`id_penilaian`
GROUP BY `penilaian`.`id_alternatif`, `detail_penilaian`.`id_kriteria`
SELECT *
FROM `kriteria`

    public function ranking()
    {
        $db = \Config\Database::connect();
        $query = $db->table('hasil')
                    ->select('hasil.*, alternatif.nama_alternatif, alternatif.lokasi')
                    ->join('alternatif', 'alternatif.id_alternatif = hasil.id_alternatif')
                    ->orderBy('ranking', 'ASC')
                    ->get();
---
SELECT `hasil`.*, `alternatif`.`nama_alternatif`, `alternatif`.`lokasi`
FROM `hasil`
JOIN `alternatif` ON `alternatif`.`id_alternatif` = `hasil`.`id_alternatif`
ORDER BY `ranking` ASC