app/Controllers/Smart.php

    private function getAllUsersForFilter()
    {
        if (session()->get('role') == 'admin') {
            return $this->userModel->where('role', 'user')->findAll();
---
SELECT *
FROM `users`
WHERE `role` = 'user'

    private function getUserBobot($id_user)
    {
        $kriteria = $this->kriteriaModel->findAll();

        // If global, we get average bobot, otherwise specific user
        $bobotMap = [];
        if ($id_user === 'global') {
            $db = \Config\Database::connect();
            $bobotQuery = $db->table('user_bobot_kriteria')
                             ->select('id_kriteria, AVG(bobot) as avg_bobot')
                             ->groupBy('id_kriteria')
                             ->get()->getResultArray();
---
SELECT *
FROM `kriteria`
SELECT `id_kriteria`, AVG(nilai_kepentingan) as avg_bobot
FROM `user_bobot_kriteria`
GROUP BY `id_kriteria`

    public function kriteria()
    {
        if (session()->get('role') != 'admin') return redirect()->to(base_url('home'));

        $data = [
            'title'    => 'Kriteria Master | SPK SMART',
            'kriteria' => $this->kriteriaModel->findAll()
        ];
---
SELECT *
FROM `kriteria`

    public function penilaian()
    {
        $id_user = $this->getActiveUserId();
        $db = \Config\Database::connect();
        $kriteria = $this->kriteriaModel->findAll();

        if ($id_user === 'global') {
            // Rata-rata Penilaian Global
            $rataQuery = $db->table('detail_penilaian')
                            ->select('penilaian.id_alternatif, detail_penilaian.id_kriteria, AVG(detail_penilaian.nilai) as rata_nilai')
                            ->join('penilaian', 'penilaian.id_penilaian = detail_penilaian.id_penilaian')
                            ->groupBy('penilaian.id_alternatif, detail_penilaian.id_kriteria')
                            ->get()->getResultArray();

            $matrixAvg = [];
            foreach ($rataQuery as $r) {
                $matrixAvg[$r['id_alternatif']][$r['id_kriteria']] = (float) $r['rata_nilai'];
            }

            // Fake data structure for the view
            $alternatifDb = $this->alternatifModel->findAll();
---
SELECT *
FROM `kriteria`
SELECT `penilaian`.`id_alternatif`, `detail_penilaian`.`id_kriteria`, AVG(detail_penilaian.nilai) as rata_nilai
FROM `detail_penilaian`
JOIN `penilaian` ON `penilaian`.`id_penilaian` = `detail_penilaian`.`id_penilaian`
GROUP BY `penilaian`.`id_alternatif`, `detail_penilaian`.`id_kriteria`
SELECT *
FROM `alternatif`

                          ->where('penilaian.id_user', $id_user)
                          ->orderBy('alternatif.id_alternatif', 'ASC');

            $penilaian = $builder->get()->getResultArray();
---
SELECT *
FROM `alternatif`

    public function rata_rata()
    {
        $id_user = $this->getActiveUserId();
        $db = \Config\Database::connect();

        if ($id_user === 'global') {
            $rataQuery = $db->table('detail_penilaian')
                            ->select('penilaian.id_alternatif, detail_penilaian.id_kriteria, AVG(detail_penilaian.nilai) as rata_nilai')
                            ->join('penilaian', 'penilaian.id_penilaian = detail_penilaian.id_penilaian')
                            ->groupBy('penilaian.id_alternatif, detail_penilaian.id_kriteria')
                            ->get()->getResultArray();
            $targetUser = ['nama' => 'Seluruh User (Agregasi Global)'];
        } else {
            $rataQuery = $db->table('detail_penilaian')
                            ->select('penilaian.id_alternatif, detail_penilaian.id_kriteria, detail_penilaian.nilai as rata_nilai')
                            ->join('penilaian', 'penilaian.id_penilaian = detail_penilaian.id_penilaian')
                            ->where('penilaian.id_user', $id_user)
                            ->get()->getResultArray();
            $targetUser = $this->userModel->find($id_user);
        }

        $matrix = [];
        foreach ($rataQuery as $r) {
            $matrix[$r['id_alternatif']][$r['id_kriteria']] = (float) $r['rata_nilai'];
        }

        $alternatif = $this->alternatifModel->findAll();
        $kriteria = $this->kriteriaModel->findAll();
---
SELECT `penilaian`.`id_alternatif`, `detail_penilaian`.`id_kriteria`, AVG(detail_penilaian.nilai) as rata_nilai
FROM `detail_penilaian`
JOIN `penilaian` ON `penilaian`.`id_penilaian` = `detail_penilaian`.`id_penilaian`
GROUP BY `penilaian`.`id_alternatif`, `detail_penilaian`.`id_kriteria`
SELECT *
FROM `alternatif`
SELECT *
FROM `kriteria`

                        ->orderBy('ranking', 'ASC')
                        ->get();
            $rankingArray = $query->getResultArray();
            $targetUser = $this->userModel->find($id_user);
---
SELECT *
FROM `users`
WHERE `users`.`id_user` = '2'

    private function getUtilityData($id_user)
    {
        $db = \Config\Database::connect();
        if ($id_user === 'global') {
            $rataQuery = $db->table('detail_penilaian')
                            ->select('penilaian.id_alternatif, detail_penilaian.id_kriteria, AVG(detail_penilaian.nilai) as rata_nilai')
                            ->join('penilaian', 'penilaian.id_penilaian = detail_penilaian.id_penilaian')
                            ->groupBy('penilaian.id_alternatif, detail_penilaian.id_kriteria')
                            ->get()->getResultArray();
        } else {
            $rataQuery = $db->table('detail_penilaian')
                            ->select('penilaian.id_alternatif, detail_penilaian.id_kriteria, detail_penilaian.nilai as rata_nilai')
                            ->join('penilaian', 'penilaian.id_penilaian = detail_penilaian.id_penilaian')
                            ->where('penilaian.id_user', $id_user)
                            ->get()->getResultArray();
        }

        $matrix = [];
        foreach ($rataQuery as $r) {
            $matrix[$r['id_alternatif']][$r['id_kriteria']] = (float) $r['rata_nilai'];
        }

        $alternatif = $this->alternatifModel->findAll();
        $kriteria = $this->kriteriaModel->findAll();
---
SELECT `penilaian`.`id_alternatif`, `detail_penilaian`.`id_kriteria`, AVG(detail_penilaian.nilai) as rata_nilai
FROM `detail_penilaian`
JOIN `penilaian` ON `penilaian`.`id_penilaian` = `detail_penilaian`.`id_penilaian`
GROUP BY `penilaian`.`id_alternatif`, `detail_penilaian`.`id_kriteria`
SELECT `penilaian`.`id_alternatif`, `detail_penilaian`.`id_kriteria`, `detail_penilaian`.`nilai` as `rata_nilai`
FROM `detail_penilaian`
JOIN `penilaian` ON `penilaian`.`id_penilaian` = `detail_penilaian`.`id_penilaian`
WHERE `penilaian`.`id_user` = '2'
SELECT *
FROM `kriteria`
SELECT *
FROM `alternatif`