app/Controllers/UserBobot.php

    public function index()
    {
        $id_user = session()->get('id_user');
        if (session()->get('role') == 'admin') {
            return redirect()->to(base_url('home'))->with('error', 'Fitur atur bobot hanya untuk User Decision Maker.');
        }

        $kriteria = $this->kriteriaModel->findAll();
---
SELECT *
FROM `kriteria`